{
  "DSVersion": "0.1.0",
  "vendorConfigVersion": "0.1.0",
  "url": "https://wnc-cbd.com/products/thca-black-cherry-gelato-indoor-hydro.html",
  "vendorName": "WNC",
  "scrapeDate": "2024-06-20T06:07:53.937Z",
  "name": "THCa Black Cherry Gelato Indoor Hydro",
  "price": [
    "$35.00",
    "$64.99",
    "$75.00",
    "$145.00"
  ],
  "image": "https://cdn11.bigcommerce.com/s-mpabgyqav0/images/stencil/160w/products/313/7139/Black_Cherry_Gelato_-_1_3__54897.1712237226.jpg?c=1",
  "description": "Description\n        \n\n\n        \n            * WARNING * HIGH THCA HEMP FLOWER IS FOR EXPERIENCED CANNABIS USERS * LIMITED SUPPLY SMALL BATCH *\n60/40 Indica Dominant Hybrid\nBlack Cherry Gelato is a tantalizing strain renowned for its decadent flavor profile, reminiscent of ripe black cherries with a creamy undertone. Upon inhalation, its rich aroma fills the senses with notes of sweet berries and hints of earthiness, evoking a sense of indulgence. This hybrid strain induces a euphoric and uplifting high, gently melting away stress and tension while promoting a relaxed state of mind. Its effects are balanced, offering both mental clarity and physical relaxation, making it ideal for daytime or evening consumption. If you are sensitive to THC, please do not purchase this product, use with caution! Please be responsible with this product and consume in the comfort of your home. Do not drive or operate heavy machinery while using this product. This product is best used when mixed with CBD for a full on entourage effect and is very powerful. Please check your state and local laws before purchasing high THCa hemp flower. Buds range in size from medium to small and are slowly cold cured for the perfect cure and moisture content. Black Cherry Gelato tests high in Caryophyllene, Linalool, and Limonene.\nTerpenes - 3.937%\nTHCVA - ND%\nD9 - THC - 0.110%\nTHCA - 21.916%\nCBGA - 1.130%\nCBCA - <LOQ%\nTOTAL Cannabinoids - 23.157%\nEmail for bulk options (Dispensaries only)\nYou must be 21 years of age or older to purchase this product.\nThis product contains industrial (Lab Tested) hemp (Hemp Flower) that was grown pursuant to state and federal law (Containing not more than 0.3% delta-9 THC on a dry weight basis) by licensed farmers in accordance with the industrial Hemp provisions of the Agricultural Act of 2014 (known as the \"Farm Act\") and its state law counterparts thus it is not subject to regulation, or control, under the Federal Controlled Substances Act. The FDA has not evaluated this product and these statements for safety or efficacy. As with any new product, consult your physician before consuming this product. Do not consume if pregnant or breastfeeding. This hemp-derived product may contain trace amounts of Delta-9 THC in accordance with the 2018 Farm Bill. For this reason, use or consumption of this product may result in a failed drug test. The purchaser of this product bears all risk and assumes all liability associated with the use, purchase, and possession of this product",
  "variants": [
    "3.5g",
    "7g",
    "14g (small/minis)",
    "28g (small/minis)"
  ]
}